
#+TITLE: Visión por Computadora 
#+author: Eduardo Alcaraz
#+email: eduardo.ac@morelia.tecnm.mx


** Canales de color
#+BEGIN_SRC python :results output
import cv2 as cv
import numpy as np 
img = cv.imread('img/tr.png')
img2 = np.zeros(img.shape[:2], dtype=np.uint8)
#print(img.shape[1])
b,g,r =cv.split(img)
rb=cv.merge([g,b,r])
rg=cv.merge([img2,g,img2])
rr=cv.merge([img2,img2,r])
cv.imshow('img', img)
cv.imshow('b',b)
cv.imshow('g',g)
cv.imshow('r',r)
cv.imshow('rb',rb)
cv.imshow('gr',rg)
cv.imshow('rr',rr)
cv.waitKey(0)
cv.destroyAllWindows()
#+END_SRC

#+RESULTS:
: 635

*** Escalamiento 
	 El escalamiento puede entenderse como hacer una figura geométrica
	 cambie su tamaño o cambie su escala. Un escalamiento en x lo
	 podemos representar  como $\hat{x} = x$,  $s_x$ y en y como
	 $\hat{y} = y$,  $s_y$ En coordenada homogéneas se puede expresar como 

$$
 \begin{pmatrix}
 \hat{x}\\
 \hat{y}&\\
 1
 \end{pmatrix}
 = 
 \begin{pmatrix}
 s_x & 0& 0\\
 0 & s_y & 0&\\
 0 & 0 & 1
 \end{pmatrix}
\begin{pmatrix}
 x\\
 y&\\
 1
 \end{pmatrix}
$$	

 #+BEGIN_SRC python :results output :tangle src/escalamiento.py
import cv2 as cv
import numpy as np
img = cv.imread('/home/likcos/Imágenes/mo1.png',0)
h,w = img.shape[:2]
print(h, w)
img2 = np.zeros((h*3, w*3) , dtype = "uint8")
print("Valores " + str(img.shape[:2]))
for i in range(h):
    for j in range(w):
        img2[int(i*0.5),int(j*0.5)]=img[i,j]

cv.imshow('imagen', img)
cv.imshow('imagen2', img2)
cv.waitKey(0)
cv.destroyAllWindows()

 #+END_SRC

 #+RESULTS:
 : 441 524
 : Valores (441, 524)

*** Flujo óptico 

El flujo óptico es un concepto en visión por computadora y
procesamiento de imágenes que se refiere al patrón de movimiento
aparente de los objetos, las superficies y los bordes en una escena
visual causado por el movimiento relativo entre un observador y la
escena. La idea es estimar cómo se mueven los puntos de una imagen
entre dos cuadros consecutivos de un video o entre dos imágenes
tomadas en momentos diferentes.

*Conceptos Clave del Flujo Óptico:* Vector de Movimiento: Cada punto en
la imagen tiene asociado un vector que indica la dirección y la
magnitud del movimiento de ese punto entre dos cuadros.

*Consistencia de Brillo*: Se asume que el brillo (intensidad) de un
punto en la imagen permanece constante entre cuadros consecutivos, lo
que permite relacionar los puntos en diferentes cuadros.

*Restricciones Espaciales y Temporales*: Se considera que los puntos
vecinos en una imagen tienden a tener movimientos similares, y este
movimiento cambia suavemente a lo largo del tiempo.

*Métodos para Calcular el Flujo Óptico*: Métodos Basados en Gradientes:
Utilizan las variaciones del brillo y los gradientes de la imagen para
calcular el movimiento. Un ejemplo es el algoritmo de Lucas-Kanade,
que asume que el flujo óptico es esencialmente constante en una
pequeña ventana de la imagen.

*Métodos Basados en Bloques*: Comparan bloques (pequeñas áreas) de un
cuadro con los del cuadro siguiente, buscando el bloque que mejor se
ajuste. Esto se hace por ejemplo en la técnica de coincidencia de
bloques.

*Métodos Basados en Características*: Identifican características
distintivas en las imágenes (como esquinas o bordes) y rastrean cómo
se mueven estas características entre los cuadros.

*Métodos Basados en Aprendizaje Profundo*: Utilizan redes neuronales
para aprender y predecir el movimiento en secuencias de imágenes.

*Aplicaciones del Flujo Óptico*:
*Seguimiento de Objetos*: Rastrear el movimiento de objetos en videos.
*Estabilización de Video*: Corregir la sacudida en las grabaciones de video.
*Reconstrucción de Escenas 3D*: Ayuda a entender la estructura tridimensional del entorno.
*Análisis de Movimiento*: En deportes o medicina para analizar movimientos del cuerpo humano.

*Limitaciones:* 
Sensible a cambios de iluminación.  No funciona bien en
escenas con mucho movimiento o sin texturas.  
La asunción de consistencia de brillo no siempre es válida.  
El flujo óptico es una herramienta poderosa en visión por computadora, pero su precisión y
eficacia dependen en gran medida del método específico utilizado y de
las características de la escena que se está analizando.

#+BEGIN_SRC python :results output
import numpy as np 
import cv2 as cv

cap = cv.VideoCapture(0)


lkparm =dict(winSize=(15,15), maxLevel=2,
             criteria=(cv.TERM_CRITERIA_EPS | cv.TERM_CRITERIA_COUNT, 10, 0.03)) 


_, vframe = cap.read()
vgris = cv.cvtColor(vframe, cv.COLOR_BGR2GRAY)
p0 = np.array([(100,100), (200,100), (300,100), (400,100), (500,100),
               (100,200), (200,200), (300,200), (400,200), (500,200),
               (100,300), (200,300), (300,300), (400,300), (500,300),
               (100,400), (200,400), (300,400), (400,400), (500,400)])

p0 = np.float32(p0[:, np.newaxis, :])

mask = np.zeros_like(vframe)
cad =''

while True:
    _, frame = cap.read()
    fgris = cv.cvtColor(frame, cv.COLOR_BGR2GRAY)
    p1, st, err = cv.calcOpticalFlowPyrLK(vgris, fgris, p0, None, **lkparm) 

    if p1 is None:
        vgris = cv.cvtColor(vframe, cv.COLOR_BGR2GRAY)
        p0 = np.array([(100,100), (200,100), (300,100), (400,100) ])
        p0 = np.float32(p0[:, np.newaxis, :])
        mask = np.zeros_like(vframe)
        cv.imshow('ventana', frame)
    else:
        bp1 = p1[st ==1]
        bp0 = p0[st ==1]
        
        for i, (nv, vj) in enumerate(zip(bp1, bp0)):
            a, b = (int(x) for x in nv.ravel())
            c, d = (int(x) for x in vj.ravel())
            dist = np.linalg.norm(nv.ravel() - vj.ravel())

            #print(i, dist)
            
            
            
            frame = cv.line(frame, (c,d), (a,b), (0,0,255), 2)
            frame = cv.circle(frame, (c,d), 2, (255,0,0),-1)
            frame = cv.circle(frame, (a,b), 3, (0,255,0),-1)
        cv.imshow('ventana', frame)

        vgris = fgris.copy()

        if(cv.waitKey(1) & 0xff) == 27:
            break

cap.release()
cv.destroyAllWindows()
#+END_SRC

#+BEGIN_SRC python :results output
import numpy as np 
import cv2 as cv

cap = cv.VideoCapture(0)


lkparm =dict(winSize=(15,15), maxLevel=2,
             criteria=(cv.TERM_CRITERIA_EPS | cv.TERM_CRITERIA_COUNT, 10, 0.03)) 


_, vframe = cap.read()
vgris = cv.cvtColor(vframe, cv.COLOR_BGR2GRAY)
p0 = np.array([(100,100), (200,100), (300,100), (400,100)])
p0 = np.float32(p0[:, np.newaxis, :])

mask = np.zeros_like(vframe)
cad =''

while True:
    _, frame = cap.read()
    fgris = cv.cvtColor(frame, cv.COLOR_BGR2GRAY)
    p1, st, err = cv.calcOpticalFlowPyrLK(vgris, fgris, p0, None, **lkparm) 

    if p1 is None:
        vgris = cv.cvtColor(vframe, cv.COLOR_BGR2GRAY)
        p0 = np.array([(100,100), (200,100), (300,100), (400,100) ])
        p0 = np.float32(p0[:, np.newaxis, :])
        mask = np.zeros_like(vframe)
        cv.imshow('ventana', frame)
    else:
        bp1 = p1[st ==1]
        bp0 = p0[st ==1]
        
        for i, (nv, vj) in enumerate(zip(bp1, bp0)):
            a, b = (int(x) for x in nv.ravel())
            c, d = (int(x) for x in vj.ravel())
            dist = np.linalg.norm(nv.ravel() - vj.ravel())

            #print(i, dist)
            
            if i == 0 and dist > 30 :
                cad = cad + '0' 
            elif i == 1 and dist > 30 :
                cad = cad + '1' 
            elif i == 2 and dist > 30 :    
                print('2', dist)
                cad = cad + '2' 
            elif i== 3 and dist > 30 :
                cad= cad+'3' 
           
            frame = cv.putText(frame, cad, (50,50),
                               cv.FONT_HERSHEY_SIMPLEX, 1 , (255,0,0),2, cv.LINE_AA)    
            frame = cv.putText(frame, str(i), (c,d),
                               cv.FONT_HERSHEY_SIMPLEX, 1 , (255,0,0),2, cv.LINE_AA)    
            
            frame = cv.line(frame, (c,d), (a,b), (0,0,255), 2)
            frame = cv.circle(frame, (c,d), 2, (255,0,0),-1)
            frame = cv.circle(frame, (a,b), 3, (0,255,0),-1)
        cv.imshow('ventana', frame)

        vgris = fgris.copy()

        if(cv.waitKey(1) & 0xff) == 27:
            break

cap.release
cv.destroyAllWindows()
  #+END_SRC


#+BEGIN_SRC python :results output
import numpy as np
import cv2 as cv

# Inicializa la captura de video desde la cámara
cap = cv.VideoCapture(0)

# Parámetros para el flujo óptico de Lucas-Kanade
lk_params = dict(winSize=(15, 15), maxLevel=2,
                 criteria=(cv.TERM_CRITERIA_EPS | cv.TERM_CRITERIA_COUNT, 10, 0.03))

# Captura el primer frame y conviértelo a escala de grises
ret, old_frame = cap.read()
old_gray = cv.cvtColor(old_frame, cv.COLOR_BGR2GRAY)

# Define el punto inicial para el seguimiento (en este caso, el centro del rectángulo)
start_point = np.array([[old_frame.shape[1] // 2, old_frame.shape[0] // 2]], np.float32)


while True:
    # Captura un nuevo frame
    ret, frame = cap.read()
    if not ret:
        break
    frame_gray = cv.cvtColor(frame, cv.COLOR_BGR2GRAY)

    # Calcula el flujo óptico
    new_points, status, error = cv.calcOpticalFlowPyrLK(old_gray, frame_gray, start_point, None, **lk_params)

    # Selecciona los puntos buenos
    if status[0] == 1:
        good_new = new_points[0]
        good_old = start_point[0]

        # Dibuja el circulo en la nueva posición
        a, b = good_new.ravel()
        start_point = np.array([[a, b]], np.float32)
        center = (int(a), int(b))
        frame = cv.circle(frame, center, 50, (0, 255, 0), -1)

    # Muestra el frame con el rectángulo
    cv.imshow('Flujo Optico', frame)

    # Actualiza el frame anterior y los puntos
    old_gray = frame_gray.copy()

    # Salir del bucle si se presiona la tecla 'Esc'
    if cv.waitKey(1) & 0xFF == 27:
        break

# Libera los recursos
cap.release()
cv.destroyAllWindows()
#+END_SRC


  
#+RESULTS:
#+begin_example
2 120.083694
2 120.879524
2 140.26334
2 186.67227
2 137.3906
2 62.329464
2 64.929184
2 69.902626
2 54.96874
2 52.69248
2 60.124416
2 63.391445
2 89.591415
2 56.381046
2 62.464
2 43.80231
2 39.35062
2 49.12454
2 46.783375
2 38.045883
2 33.4635
2 31.740929
2 57.095345
2 41.95649
2 82.12661
2 58.450493
2 50.61094
2 56.976192
2 52.000736
2 87.50451
2 53.20077
2 67.31267
2 69.54097
2 63.143032
2 35.948177
2 95.95501
2 74.23872
2 76.64836
2 68.564
2 87.3111
2 74.414635
2 72.70697
2 61.554096
#+end_example


** Eigenfaces 

Un Eigenface (en español cara propia) es el nombre dado a un conjunto
de vectores propios cuando se utiliza en el problema de visión
artificial del reconocimiento de rostros humanos. Sirovich y Kirby
desarrollaron el enfoque de usar caras propias para el reconocimiento
y lo usaron Matthew Turk y Alex Pentland en la clasificación de
caras. Los vectores propios se derivan de la matriz de covarianza de
la distribución de probabilidad sobre el espacio vectorial de alta
dimensión de imágenes de rostros. Las caras propias forman un conjunto
base de todas las imágenes utilizadas para construir la matriz de
covarianza. Esto produce una reducción de la dimensión al permitir que
el conjunto más pequeño de imágenes base represente las imágenes de
entrenamiento originales. La clasificación se puede lograr comparando
cómo se representan las caras por el conjunto base.

 *Generación*
 Se puede generar un conjunto de caras propias mediante la realización
 de un proceso matemático llamado análisis de componentes principales
 (PCA) en un gran conjunto de imágenes que representan diferentes
 rostros humanos. De manera informal, las caras propias pueden
 considerarse un conjunto de "ingredientes faciales estandarizados",
 derivados del análisis estadístico de muchas imágenes de
 rostros. Cualquier rostro humano puede considerarse una combinación
 de estos rostros estándar. Por ejemplo, la cara de uno podría estar
 compuesta por la cara promedio más el 10 % de la cara propia 1, el 55
 % de la cara propia 2 e incluso el −3 % de la cara
 propia 3. Sorprendentemente, no se necesitan muchas caras propias
 combinadas para lograr una aproximación justa de la mayoría de las
 caras. Además, debido a que la cara de una persona no se registra
 mediante una fotografía digital, sino simplemente como una lista de
 valores (un valor para cada cara propia en la base de datos
 utilizada), se ocupa mucho menos espacio para la cara de cada
 persona.

 Las caras propias que se crean aparecerán como áreas claras y oscuras
 que se organizan en un patrón específico. Este patrón es cómo se
 seleccionan las diferentes características de una cara para
 evaluarlas y puntuarlas. Habrá un patrón para evaluar la simetría, si
 hay algún estilo de vello facial, dónde está la línea del cabello o
 una evaluación del tamaño de la nariz o la boca. Otras caras propias
 tienen patrones que son menos fáciles de identificar, y la imagen de
 la cara propia puede parecerse muy poco a una cara.

 La técnica utilizada en la creación de caras propias y su uso para el
 reconocimiento también se utiliza fuera del reconocimiento facial:
 reconocimiento de escritura a mano, lectura de labios, reconocimiento
 de voz, lenguaje de señas /interpretación de gestos con las manos y
 análisis de imágenes médicas. Por lo tanto, algunos no usan el
 término "eigenface", sino que prefieren usar 'eigenimage'.



#+BEGIN_SRC python :results output
import cv2 as cv 
import numpy as np 
import os
dataSet = '/home/likcos/pruebacaras'
faces  = os.listdir(dataSet)
print(faces)

labels = []
facesData = []
label = 0 
for face in faces:
    facePath = dataSet+'/'+face
    for faceName in os.listdir(facePath):
        labels.append(label)
        facesData.append(cv.imread(facePath+'/'+faceName,0))
    label = label + 1
print(np.count_nonzero(np.array(labels)==0)) 

faceRecognizer = cv.face.EigenFaceRecognizer_create()
faceRecognizer.train(facesData, np.array(labels))
faceRecognizer.write('laloEigenface.xml')

#+END_SRC

#+RESULTS:
: ['lalo']
: 169

#+BEGIN_SRC python
import cv2 as cv
import os 

faceRecognizer = cv.face.EigenFaceRecognizer_create()
faceRecognizer.read('laloEigenface.xml')

cap = cv.VideoCapture(0)
rostro = cv.CascadeClassifier('data/haarcascade_frontalface_alt.xml')
while True:
    ret, frame = cap.read()
    if ret == False: break
    gray = cv.cvtColor(frame, cv.COLOR_BGR2GRAY)
    cpGray = gray.copy()
    rostros = rostro.detectMultiScale(gray, 1.3, 3)
    for(x, y, w, h) in rostros:
        frame2 = cpGray[y:y+h, x:x+w]
        frame2 = cv.resize(frame2,  (100,100), interpolation=cv.INTER_CUBIC)
        result = faceRecognizer.predict(frame2)
        #cv.putText(frame, '{}'.format(result), (x,y-20), 1,3.3, (255,255,0), 1, cv.LINE_AA)
        if result[1] > 2800:
            cv.putText(frame,'{}'.format(faces[result[0]]),(x,y-25),2,1.1,(0,255,0),1,cv.LINE_AA)
            cv.rectangle(frame, (x,y),(x+w,y+h),(0,255,0),2)
        else:
            cv.putText(frame,'Desconocido',(x,y-20),2,0.8,(0,0,255),1,cv.LINE_AA)
            cv.rectangle(frame, (x,y),(x+w,y+h),(0,0,255),2)
    cv.imshow('frame', frame)
    k = cv.waitKey(1)
    if k == 27:
        break
cap.release()
cv.destroyAllWindows()

#+END_SRC

#+RESULTS:



